zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/same51g-pinctrl.h
/* pa23j_iis_fs1 */
#define PA23J_IIS_FS1 \
	SAM_PINMUX(a, 23, j, periph)

/* pa23k_pcc_data7 */
#define PA23K_PCC_DATA7 \
	SAM_PINMUX(a, 23, k, periph)

/* pa23n_ccl_in7 */
#define PA23N_CCL_IN7 \
	SAM_PINMUX(a, 23, n, periph)

/* pa24_gpio */
#define PA24_GPIO \
	SAM_PINMUX(a, 24, gpio, gpio)

/* pa24a_eic_extint8 */
#define PA24A_EIC_EXTINT8 \
	SAM_PINMUX(a, 24, a, periph)

/* pa24c_sercom3_pad2 */
#define PA24C_SERCOM3_PAD2 \
	SAM_PINMUX(a, 24, c, periph)

/* pa24d_sercom5_pad2 */
#define PA24D_SERCOM5_PAD2 \
	SAM_PINMUX(a, 24, d, periph)

/* pa24e_tc5_wo0 */
#define PA24E_TC5_WO0 \
	SAM_PINMUX(a, 24, e, periph)

/* pa24f_tcc2_wo2 */
#define PA24F_TCC2_WO2 \
	SAM_PINMUX(a, 24, f, periph)

/* pa24g_pdec_qdi0 */
#define PA24G_PDEC_QDI0 \
	SAM_PINMUX(a, 24, g, periph)

/* pa24h_usb_dm */
#define PA24H_USB_DM \
	SAM_PINMUX(a, 24, h, periph)

/* pa24i_can0_tx */
#define PA24I_CAN0_TX \
	SAM_PINMUX(a, 24, i, periph)

/* pa24n_ccl_in8 */
#define PA24N_CCL_IN8 \
	SAM_PINMUX(a, 24, n, periph)

/* pa25_gpio */
#define PA25_GPIO \
	SAM_PINMUX(a, 25, gpio, gpio)

/* pa25a_eic_extint9 */
#define PA25A_EIC_EXTINT9 \
	SAM_PINMUX(a, 25, a, periph)

/* pa25c_sercom3_pad3 */
#define PA25C_SERCOM3_PAD3 \
	SAM_PINMUX(a, 25, c, periph)

/* pa25d_sercom5_pad3 */
#define PA25D_SERCOM5_PAD3 \
	SAM_PINMUX(a, 25, d, periph)

/* pa25e_tc5_wo1 */
#define PA25E_TC5_WO1 \
	SAM_PINMUX(a, 25, e, periph)

/* pa25g_pdec_qdi1 */
#define PA25G_PDEC_QDI1 \
	SAM_PINMUX(a, 25, g, periph)

/* pa25h_usb_dp */
#define PA25H_USB_DP \
	SAM_PINMUX(a, 25, h, periph)

/* pa25i_can0_rx */
#define PA25I_CAN0_RX \
	SAM_PINMUX(a, 25, i, periph)

/* pa25n_ccl_out2 */
#define PA25N_CCL_OUT2 \
	SAM_PINMUX(a, 25, n, periph)

/* pa27_gpio */
#define PA27_GPIO \
	SAM_PINMUX(a, 27, gpio, gpio)

/* pa27a_eic_extint11 */
#define PA27A_EIC_EXTINT11 \
	SAM_PINMUX(a, 27, a, periph)

/* pa27b_ptc_xy18 */
#define PA27B_PTC_XY18 \
	SAM_PINMUX(a, 27, b, periph)

/* pa27m_gclk_io1 */
#define PA27M_GCLK_IO1 \
	SAM_PINMUX(a, 27, m, periph)

/* pa30_gpio */
#define PA30_GPIO \
	SAM_PINMUX(a, 30, gpio, gpio)

/* pa30a_eic_extint14 */
#define PA30A_EIC_EXTINT14 \
	SAM_PINMUX(a, 30, a, periph)

/* pa30b_ptc_xy19 */
#define PA30B_PTC_XY19 \
	SAM_PINMUX(a, 30, b, periph)

/* pa30d_sercom1_pad2 */
#define PA30D_SERCOM1_PAD2 \
	SAM_PINMUX(a, 30, d, periph)

/* pa30e_tc6_wo0 */
#define PA30E_TC6_WO0 \
	SAM_PINMUX(a, 30, e, periph)

/* pa30f_tcc2_wo0 */
#define PA30F_TCC2_WO0 \
	SAM_PINMUX(a, 30, f, periph)

/* pa30h_swd_clk */
#define PA30H_SWD_CLK \
	SAM_PINMUX(a, 30, h, periph)

/* pa30m_gclk_io0 */
#define PA30M_GCLK_IO0 \
	SAM_PINMUX(a, 30, m, periph)

/* pa30n_ccl_in3 */
#define PA30N_CCL_IN3 \
	SAM_PINMUX(a, 30, n, periph)

/* pa31_gpio */
#define PA31_GPIO \
	SAM_PINMUX(a, 31, gpio, gpio)

/* pa31a_eic_extint15 */
#define PA31A_EIC_EXTINT15 \
	SAM_PINMUX(a, 31, a, periph)

/* pa31d_sercom1_pad3 */
#define PA31D_SERCOM1_PAD3 \
	SAM_PINMUX(a, 31, d, periph)

/* pa31e_tc6_wo1 */
#define PA31E_TC6_WO1 \
	SAM_PINMUX(a, 31, e, periph)

/* pa31f_tcc2_wo1 */
#define PA31F_TCC2_WO1 \
	SAM_PINMUX(a, 31, f, periph)

/* pa31h_swd_io */
#define PA31H_SWD_IO \
	SAM_PINMUX(a, 31, h, periph)

/* pa31n_ccl_out1 */
#define PA31N_CCL_OUT1 \
	SAM_PINMUX(a, 31, n, periph)

/* pb2_gpio */
#define PB2_GPIO \
	SAM_PINMUX(b, 2, gpio, gpio)

/* pb2a_eic_extint2 */
#define PB2A_EIC_EXTINT2 \
	SAM_PINMUX(b, 2, a, periph)

/* pb2b_adc0_ain14 */
#define PB2B_ADC0_AIN14 \
	SAM_PINMUX(b, 2, b, periph)

/* pb2b_ptc_xy20 */
#define PB2B_PTC_XY20 \
	SAM_PINMUX(b, 2, b, periph)

/* pb2d_sercom5_pad0 */
#define PB2D_SERCOM5_PAD0 \
	SAM_PINMUX(b, 2, d, periph)

/* pb2e_tc6_wo0 */
#define PB2E_TC6_WO0 \
	SAM_PINMUX(b, 2, e, periph)

/* pb2f_tcc2_wo2 */
#define PB2F_TCC2_WO2 \
	SAM_PINMUX(b, 2, f, periph)

/* pb2n_ccl_out0 */
#define PB2N_CCL_OUT0 \
	SAM_PINMUX(b, 2, n, periph)

/* pb3_gpio */
#define PB3_GPIO \
	SAM_PINMUX(b, 3, gpio, gpio)

/* pb3a_eic_extint3 */
#define PB3A_EIC_EXTINT3 \
	SAM_PINMUX(b, 3, a, periph)

/* pb3b_adc0_ain15 */
#define PB3B_ADC0_AIN15 \
	SAM_PINMUX(b, 3, b, periph)

/* pb3b_ptc_xy21 */
#define PB3B_PTC_XY21 \
	SAM_PINMUX(b, 3, b, periph)

/* pb3d_sercom5_pad1 */
#define PB3D_SERCOM5_PAD1 \
	SAM_PINMUX(b, 3, d, periph)

/* pb3e_tc6_wo1 */
#define PB3E_TC6_WO1 \
	SAM_PINMUX(b, 3, e, periph)

/* pb8_gpio */
#define PB8_GPIO \
	SAM_PINMUX(b, 8, gpio, gpio)

/* pb8a_eic_extint8 */
#define PB8A_EIC_EXTINT8 \
	SAM_PINMUX(b, 8, a, periph)

/* pb8b_adc0_ain2 */
#define PB8B_ADC0_AIN2 \
	SAM_PINMUX(b, 8, b, periph)

/* pb8b_adc1_ain0 */
#define PB8B_ADC1_AIN0 \
	SAM_PINMUX(b, 8, b, periph)

/* pb8b_ptc_xy1 */
#define PB8B_PTC_XY1 \
	SAM_PINMUX(b, 8, b, periph)

/* pb8d_sercom4_pad0 */
#define PB8D_SERCOM4_PAD0 \
	SAM_PINMUX(b, 8, d, periph)

/* pb8e_tc4_wo0 */
#define PB8E_TC4_WO0 \
	SAM_PINMUX(b, 8, e, periph)

/* pb8n_ccl_in8 */
#define PB8N_CCL_IN8 \
	SAM_PINMUX(b, 8, n, periph)

/* pb9_gpio */
#define PB9_GPIO \
	SAM_PINMUX(b, 9, gpio, gpio)

/* pb9a_eic_extint9 */
#define PB9A_EIC_EXTINT9 \
	SAM_PINMUX(b, 9, a, periph)

/* pb9b_adc0_ain3 */
#define PB9B_ADC0_AIN3 \
	SAM_PINMUX(b, 9, b, periph)

/* pb9b_adc1_ain1 */
#define PB9B_ADC1_AIN1 \
	SAM_PINMUX(b, 9, b, periph)

/* pb9b_ptc_xy2 */
#define PB9B_PTC_XY2 \
	SAM_PINMUX(b, 9, b, periph)

/* pb9d_sercom4_pad1 */
#define PB9D_SERCOM4_PAD1 \
	SAM_PINMUX(b, 9, d, periph)

/* pb9e_tc4_wo1 */
#define PB9E_TC4_WO1 \
	SAM_PINMUX(b, 9, e, periph)

/* pb9n_ccl_out2 */
#define PB9N_CCL_OUT2 \
	SAM_PINMUX(b, 9, n, periph)

/* pb10_gpio */
#define PB10_GPIO \
	SAM_PINMUX(b, 10, gpio, gpio)

/* pb10a_eic_extint10 */
#define PB10A_EIC_EXTINT10 \
	SAM_PINMUX(b, 10, a, periph)

/* pb10d_sercom4_pad2 */
#define PB10D_SERCOM4_PAD2 \
	SAM_PINMUX(b, 10, d, periph)

/* pb10e_tc5_wo0 */
#define PB10E_TC5_WO0 \
	SAM_PINMUX(b, 10, e, periph)

/* pb10f_tcc0_wo4 */
#define PB10F_TCC0_WO4 \
	SAM_PINMUX(b, 10, f, periph)

/* pb10g_tcc1_wo0 */
#define PB10G_TCC1_WO0 \
	SAM_PINMUX(b, 10, g, periph)

/* pb10h_qspi_sck */
#define PB10H_QSPI_SCK \
	SAM_PINMUX(b, 10, h, periph)

/* pb10i_sdhc0_dat3 */
#define PB10I_SDHC0_DAT3 \
	SAM_PINMUX(b, 10, i, periph)

/* pb10j_iis_sdi */
#define PB10J_IIS_SDI \
	SAM_PINMUX(b, 10, j, periph)

/* pb10m_gclk_io4 */
#define PB10M_GCLK_IO4 \
	SAM_PINMUX(b, 10, m, periph)

/* pb10n_ccl_in11 */
#define PB10N_CCL_IN11 \
	SAM_PINMUX(b, 10, n, periph)

